  {
    "title": "Home Page",
    "id": 189,
    "content": "MIPS is a cloud-based ship management software designed to streamline and simplify maritime operations. It offers comprehensive solutions for ship management, voyage management, crew management, and performance management. By enabling systematic and efficient operational planning at regular intervals, MIPS enhances workflow efficiency. The platform allows users to create a master library for storing common items applicable to the fleet, ensuring consistency and accessibility. It facilitates seamless collaboration between vessel operators and managers by distributing tasks efficiently between onboard and office personnel. This integration reduces operational workload, optimizes resource utilization, and maintains task management in a structured manner. Additionally, MIPS enhances communication between internal systems and onboard computers, supporting both cloud-based and on-premises hosting. It also provides comprehensive analytics and performance management insights, enabling informed decision-making and improved operational efficiency. After Logging in, the home page of the application is opened. Basic Set Up Login - Only registered users can log in. For convenience, you can also log in using Windows authentication. If your Windows account is already signed in, the system allows seamless access without requiring a password. This functions as a single sign-on (SSO) feature, simplifying the login process. Dashboards - After logging in, the dashboard page opens. The dashboard presents information in graphical formats, including pie charts and tables, allowing users to quickly navigate to specific tasks. You can create a customizable dashboard where tiles can be added and renamed as needed. Additionally, both the dashboard and individual tiles can be deleted when no longer required. My Task - This section displays the pending tasks assigned to or owned by the user, showing task counts across various modules. The count updates automatically as tasks are completed . Vessel Icon - This section is divided into two categories: 'My Vessel' displays all vessels accessed by the user, while 'My Groups' shows the groups of vessels assigned to the user. Both categories have restrictions set by the vessel managers. (?) Help Documents - Access the help documents for further guidance using wiki docs. Settings - Allows users to customize the screen settings by choosing between a dark or light theme. Profile  - Manages your profile settings with picture, change your password, and log out from this section. You can also log out via the side panel. Log out - You can log out via the side panel menu or by clicking your profile icon and selecting \"Log Out.\" User Interface Home Icon - The Home icon quickly returns users to the main dashboard or homepage for easy navigation. Favourites Icon - The Favourites icon provides quick access to frequently used items or saved preferences. Explorer - The Explorer icon allows navigation to various modules and sub-modules within the system. Live Fleet - The Live Fleet feature shows the current location of the vessel in real time. Note - If you enter an incorrect password three times, your account will be locked. To regain access, please contact the system administrator. Next will see the table of common functions applicable within the system. Common Functions Applicable ",
    "children": [
      {
        "title": "Dashboard",
        "id": 190,
        "content": "After logging in, the home page displays a landing screen where a dashboard of outstanding findings are found. Creating a New Dashboard Follow the steps below to create a new dashboard: Click on the \"+ Create New\" button. This will open up the Add Dashboard screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Note -You can add a second dashboard by clicking the \" + icon\" located in the heading. The most recently created dashboard will open by default. Renaming the Dashboard Follow the steps below to Rename the dashboard: Hover over the required Dashboard and click on it. The 3 Dot icon appears to reveal the Add Tile, Rename and Delete options. Click the 3 Dot Icon . The menu appears with three options - Add Tile, Rename, and Delete will be displayed. Click on the Rename option, the Rename dashboard screen appears. Make the required changes and click \"Save\" button. Deleting the Dashboard Follow the steps below to Delete the dashboard: Hover over the required Dashboard and click on it. The 3 Dot icon appears to reveal the Add Tile, Rename and Delete options. Click the 3 Dot Icon . The menu appears with three options - Add Tile, Rename, and Delete will be displayed. Click on the Delete option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Adding a New Tile Follow the steps below to Add the tile: Hover over the required Dashboard and click on it. Click on the \"+ Add New \" button. The Add Dashboard tile screen appears. Click on the required module. Then click \"Next\" button. Note - Only one module can be selected at a time. This page shows us the list of tiles available in Technical Module. Note - Now Inspections and Budgets include the option to create a new tile. Select the desired Technical module and check the box for the tile you wish to create. Then Click the \"Next\" button. The summary screen appears showing the selected tiles under the particular dashboard. Click the \"Save\" button. Deleting a Tile Follow the steps below to Delete a tile: Select the required Tile and click on the 3 dot icon. Click the 3 dot icon. The menu with three options - Export to pdf, Export to Excel and Delete will be displayed. Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Note - The Tiles provide a graphical representation, including pie chart views of the data. Users can expand or minimize the table and export the data in PDF or Excel format. ",
        "children": []
      }
    ]
  }