
  {
    "title": "Operations Module",
    "id": 194,
    "content": "The Operations module provides complete functionality related to a vessel, including its voyages, environmental reports such as discharges and halocarbon records, deviations and downtimes, as well as high-risk transits ",
    "children": [
      {
        "title": "Voyages ",
        "id": 195,
        "content": "A Vessel Voyage refers to the journey or trip, a ship (vessel) makes from one port to another (or multiple ports), typically including all movements, stops, and cargo or passenger activities during that trip. You can access the Voyages page from here : Explorer Menu > Operations > Voyages. Finding the Voyages for Each Vessel Follow the steps below to search the required Voyage: Select the required Vessels / Types / Fleets / Classes / Groups, Voyage Number, Condition, Status, Departure Port, Destination Port, Estimated Time for Departure (ETD), and Estimated Time for Arrival (ETA) in the search field. Click the \"Search\" button. The system will display the list of the required Voyage Details. The page displays the list of vessels in a Card view format, with the basic voyage details like Vessel Name, Status, Condition, Voyage Number, Departure Port, Estimated Time of Departure (ETD), Destination Port and Estimated Time of Arrival (ETA) of each Voyage. To Add a new Voyage, the following information is required: Vessel Name Voyage Number Condition Title / Description Departure Port Destination Port Estimated Time of Departure Estimated Time of Arrival Charterer Name Sub-Charterer Name Charter Party Speed Reason for Destination Change Remarks Adding the Voyage Follow the steps below to add a new Voyage: Click on the \"+ New\" button. This will open up the Add New Voyage screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Accessing the Details of Voyage Follow the steps below to view the Voyage details: Click on the Vessel Name where the hyperlink is given for which you want to view the details. This will open the details page by default. Modifying the Voyage Details Follow the steps below to modify the details of Voyage: Click on the Vessel Name where the hyperlink is given for which you want to view the details. This will open the details page by default. Click the \"Edit\" option. Change the required details. Click the Update button to save the information. Vessel Schedule Adding the Vessel Schedule Details Follow the steps below to add a new Vessel Schedule details: Click on the \"+ New Schedule\" button. This will open up the Add Vessel Schedule screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Note - Remember to select a date that falls within the voyage schedule. Viewing the Vessel Schedule Details Under a particular Vessel Schedule, you can click the arrow to expand and view the details. The \"View Details\" section contains two tabs: Agent List, Activity, and Port Assessment Document. The Agent List tab opens by default. Agent List This page displays the list of agent list in a table form where we can add, edit and delete the agent details. Adding the Agent List Follow the steps below to add a new Agent details: Click on the \"+ New Agent\" button. This will open up the Add Agent screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Agent List Follow the steps below to modify the required Agent Detail: Hover over the required Agent. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Edit\" option. This will open the Edit Agent screen. Change the required details. Click the \"Update\" button. Deleting the Agent List Follow the steps below to delete the Agent: Hover over the required Agent. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Activities This page shows the list of vessel-related activities, where you can add, edit, and delete each activity. Adding the Activity Follow the steps below to add a new Activity details: Click on the \"+ New Activity \" button. This will open up the Add Activity screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Activity Follow the steps below to modify the required Activity Details: Hover over the required Activity. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Edit\" option. This will open the Edit Activity screen. Change the required details. Click the \"Update\" button. Deleting the Activity Follow the steps below to delete the Activity: Hover over the required Activity. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Port Assessment Documents This page shows us the basic details in a table format with columns like Document Type, Date of Assessment, Master , Chief Engineer and attachments. Adding the Port Assessment Document Follow the steps below to add a new Port Assessment Document detail: Click on the \"Upload\" button. This will open up the Add Port Assessment Document screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Port Assessment Document Follow the steps below to modify the required Port Assessment Document Details: Hover over the required Port Assessment Document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Edit\" option. This will open the Edit Activity screen. Change the required details. Click the \"Update\" button. Deleting the Port Assessment Document Follow the steps below to delete the Port Assessment Document: Hover over the required Port Assessment Document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Modifying the Vessel Schedule Details Follow the steps below to modify the required Vessel Schedule Details: Hover over the required Vessel Schedule. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Edit\" option. This will open the Edit Vessel Schedule screen. Change the required details. Click the \"Update\" button. Deleting the Vessel Schedule Follow the steps below to delete the Vessel Schedule: Hover over the required Vessel Schedule. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Cargo This page shows the cargo details for the vessel, including type, quantity, and associated attachments. You can also add, edit, and delete each cargo detail from here. Adding the Cargo Follow the steps below to add a new Cargo details: Click on the \"+ New\" button. This will open up the Add Cargo Type Details screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Cargo Follow the steps below to modify the required Cargo Details: Hover over the required Cargo Type. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Edit\" option. This will open the Edit Cargo Type screen. Change the required details. Click the \"Update\" button. Note - The cargo type will be disabled when we edit the details. Viewing the Cargo Attachment Follow the steps below to view the Cargo Attachment: Click on the required attached document where the hyperlink is given for which you want to view the details. This will open the View Documents page in read-only mode. Click the \"Close\" button to exit. Deleting the Cargo Follow the steps below to delete the Cargo Details: Hover over the required Cargo Type. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Documents Adding the Document Follow the steps below to add a new Document details: Click on the \"Upload\" button. This will open up the Add Document screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Document Details Follow the steps below to modify the required Document Details: Hover over the required Document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Edit\" option. This will open the Edit Vessel Schedule screen. Change the required details. Click the \"Update\" button. Viewing the Document Details Follow the steps below to view the Document: Click on the required attached document where the hyperlink is given for which you want to view the details. This will open the View Documents page in read-only mode. Click the \"Close\" button to exit. Deleting the Document Follow the steps below to delete the Document: Hover over the required Document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Audit Log This page shows the audit log of the Vessel Voyage with their user details, log details and description. You can navigate through Operations > Voyage > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the log details: Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. . Click the \"Close\" button to exit. Changing the Voyage Status The status can be configured through workflows based on specific requirements, allowing for a structured and customized approval process. This ensures that status changes align with operational needs and predefined workflow rules. Remember - The applicable status and revert status can be configured as per requirements and managed through the workflow with its privileges. Follow the steps below to change the status of Vessel Voyage Hover over the required Vessel. The 3 Dot icon appears to reveal the Applicable Status, Edit, Delete, and History options. Click the 3 Dot Icon and select the \"Applicable Status\" option. Change the required status. Note - The status will be shown from the workflow based on the requirement and its privilege. Deleting the Voyage Follow the steps below to delete the Vessel Voyage: Hover over the required Vessel Voyage. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
        "children": []
      },
      {
        "title": "Daily Reports",
        "id": 196,
        "content": " ",
        "children": []
      },
      {
        "title": "Deviations and Downtimes",
        "id": 197,
        "content": "Deviation means a change from the planned route or schedule, like a ship taking a different path. You can access the Deviations and Downtime page from here : Explorer Menu > Operations > Deviations and Downtime Finding the Deviations and Downtime for Each Voyage Follow the steps below to search the required Deviations and Downtimes: Select the required Type , Vessels / Types / Fleets / Classes / Groups, Voyage Number, Reason, Status, From Date and To Date in the search field. Click the \"Search\" button. The system will display the list of the required Deviations and Downtimes Details. The page displays the list of Deviations and Downtimes in a Card view format, with the basic details like Vessel Name, Deviations or Downtimes, Status, Voyage Number, Departure Port, Destination Port, Reported Date and Reason. DEVIATION To Add a new Deviation , the following information is required: Vessel Name Type Breakdown Reported Date Reason Voyage Number Master Chief Engineer Ordered Speed Original Distance Planned Security Related Remarks Adding the Deviation Follow the steps below to add a new Deviation: Click on the \"+ New\" button. This will open up the Add New screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Note - Condition applicable for both Deviation and Downtime: If Breakdown is set to \"Yes\", then the Equipment Type field is mandatory. Accessing the Details of Deviation Follow the steps below to view the Deviation details: Click on the required Deviation where the hyperlink is given for which you want to view the details. This will open the details page by default. Deviation details screen appears Modifying the Deviation Details Follow the steps below to modify the details of Deviation: Click on the required Deviation where the hyperlink is given for which you want to view the details. This will open the details page by default. Click the \"Edit\" option. Change the required details. Click the Update button to save the information. Location This page displays location details such as location, date & time, and port in a card view format. For Deviation - We can add a Starting Point, Intermediate Point, Departed Deviation Point and a Rejoining Point. You can add any number of Intermediate Point, and Departed Deviation Point. Multiple Intermediate and Departed Deviation Points can be added. However, if you add an Intermediate Point, a corresponding Departed Deviation Point must also be added Only the last entry has both Edit and Delete options, while the previous transactions have only the Edit option available. Adding the Starting Point Details Follow the steps below to add a Starting Point details: Click on the \"+ Starting Point\" button. This will open up the Add Starting Point screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Starting Point Details Follow the steps below to modify the details of Starting Point: Hover over the Starting Point. The 3 Dot icon appears to reveal the Edit option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit Starting Point screen. Change the required details. Click the \"Update\" button. Adding the Intermediate Point Details Follow the steps below to add the Intermediate Point detail: Click on the \"+ Intermediate Point\" button. This will open up the Add Intermediate Point screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Intermediate Point Details Follow the steps below to modify the details of Intermediate Point: Hover over the required Intermediate Point. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit Intermediate Point screen. Change the required details. Click the \"Update\" button. Adding the Departed Deviation Point Details Follow the steps below to add a Departed Deviation Point details: Click on the \"+ Departed Deviation Point\" button. This will open up the Add Departed Deviation Point screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Departed Deviation Point Details Follow the steps below to modify the details of Departed Deviation Point: Hover over the required Departed Deviation Point. The 3 Dot icon appears to reveal the Edit option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit Departed Deviation Point screen. Change the required details. Click the \"Update\" button. Adding the Rejoining Point Details Follow the steps below to add the Rejoining Point detail: Click on the \"+ Rejoining Point\" button. This will open up the Add Rejoining Point screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Rejoining Point Details Follow the steps below to modify the details of Rejoining Point: Hover over the required Rejoining Point. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit Rejoining Point screen. Change the required details. Click the \"Update\" button. Deleting the Rejoining Point Details Follow the steps below to delete the details of Rejoining Point: Hover over the Rejoining Point. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up confirmation pop up screen. Click \"Yes Proceed\" button Note - The same process is applied to delete the Starting Point or Intermediate point or Departed deviation point or even the rejoining point. The Starting Point or any entry can only be deleted after the last entry has been removed. ROB ROB can be added separately for the Starting Point, Intermediate Point, Departed Deviation Point  and the Rejoining Point. Adding the ROB Details Follow the steps below to add a ROB detail: Click the arrow to expand the Starting Point, Intermediate Point, Departed Deviation Point  and the Rejoining Point.; this will open a separate section for entering ROB details. Click on the \"+ New ROB\" button. This will open up the Add ROB screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the ROB Details Follow the steps below to modify the details of ROB: Hover over the required ROB. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit ROB screen. Change the required details. Click the \"Update\" button. Deleting the ROB Details Follow the steps below to delete the details of ROB: Hover over the required ROB.  The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up confirmation pop up screen. Click \"Yes Proceed\" button Note - The same process to add, edit, and delete ROB details is followed for the Starting Point, Intermediate Point, Departed Deviation Point and the Rejoining Point as well. Summary This page provides basic deviation details such as Expected Duration, Actual Duration, Deviation Hours and Distance Covered. It also includes three sections: Analysis , which shows the reason for deviation with calculated hours, Charterer Activity, which provides details of all charterer activities along with their calculated hours and Consumptions , which displays fuel oil details—like type, bunker received, bunker adjusted, downtime consumption, and the difference—in a tabular format. Downtime hours and distance covered are auto-calculated, while consumption details are view-only on this page. Analysis Modifying the Analysis Details Click the Edit button under Analysis section. Change the required details. Click the \"Update\" button. Note - Charterer Activity This page provides charterer activities along with their calculated hours. Modifying the Charterer Activity Details Click the Edit button under Charterer Activity section. Change the required details. Click the \"Update\" button. Consumptions This page gives us the details like Fuel or Oil Type, Bunker Received, Bunker Adjusted, Expected Consumption, Actual Consumption, Difference and Charterer Consumption in a table format. Modifying the Consumption Details Click the Edit button under Consumption section. Change the required details. Click the \"Update\" button. Modifying the Superintendent Remarks Follow the steps given below to modify the remarks Click the Edit button under Remarks sections. Change the required details. Click the \"Update\" button. Documents Adding the Document Follow the steps below to add a new Document details: Click on the \"Upload\" button. This will open up the Add Document screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Document Details Follow the steps below to modify the required Document Details: Hover over the required Document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Edit\" option. This will open the Edit Documents screen. Change the required details. Click the \"Update\" button. Viewing the Document Details Follow the steps below to view the Document: Click on the required attached document where the hyperlink is given for which you want to view the details. This will open the View Documents page in read-only mode. Click the \"Close\" button to exit. Deleting the Document Follow the steps below to delete the Document: Hover over the required Document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Audit Log This page shows the audit log of the Downtime with their user details, log details and description. You can navigate through Operations > Deviation and Downtime > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the log details: Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. . Click the \"Close\" button to exit. Changing the Deviation Status The status can be configured through workflows based on specific requirements, allowing for a structured and customized approval process. This ensures that status changes align with operational needs and predefined workflow rules. Remember - The applicable status and revert status can be configured as per requirements and managed through the workflow with its privileges. Follow the steps below to change the status of Deviation Hover over the required Deviation. The 3 Dot icon appears to reveal the Applicable Status, and Delete options. Click the 3 Dot Icon and select the \"Applicable Status\" option. Change the required status. Note - The status will be shown from the workflow based on the requirement and its privilege. Deleting the Deviation Follow the steps below to delete the Deviation: Hover over the required Deviation. The 3 Dot icon appears to reveal the Current Status and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. DOWNTIME To Add a new Downtime , the following information is required: Vessel Name Type Breakdown Reported Date Reason Voyage Number Master Chief Engineer Planned Security Related Remarks Note - Condition applicable for both Deviation and Downtime: If Breakdown is set to \"Yes\", then the Equipment Type field is mandatory. Adding the Downtime Follow the steps below to add a new Downtime: Click on the \"+ New\" button. This will open up the Add New screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Accessing the Details of Downtime Follow the steps below to view the Downtime details: Click on the required Downtime where the hyperlink is given for which you want to view the details. This will open the details page by default. Downtime details screen appears Modifying the Downtime Details Follow the steps below to modify the details of Downtime: Click on the required Downtime where the hyperlink is given for which you want to view the details. This will open the details page by default. Click the \"Edit\" option. Change the required details. Click the Update button to save the information. Location For Downtime - We can add a Starting Point, and a Resumed Point. Only the last entry has both Edit and Delete options, while the previous transactions have only the Edit option available. Adding the Starting Point Details Follow the steps below to add a Starting Point detail: Click on the \"+ Starting Point\" button. This will open up the Add Starting Point screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Starting Point Details Follow the steps below to modify the details of Starting Point: Hover over the Starting Point. The 3 Dot icon appears to reveal the Edit option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit Starting Point screen. Change the required details. Click the \"Update\" button. Adding the Resumed Point Details Follow the steps below to add a Resumed Point detail: Click on the \"+ Resumed Point\" button. This will open up the Add Resumed Point screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Resumed Point Details Follow the steps below to modify the details of Resumed Point: Hover over the Resumed Point. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit Resumed Point screen. Change the required details. Click the \"Update\" button. Deleting the Resumed Point Details Follow the steps below to delete the details of Resumed Point: Hover over the Starting Point. The 3 Dot icon appears to reveal the Edit option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up confirmation pop up screen. Click \"Yes Proceed\" button Note - The same process is applied to delete the Starting Point. It can only be deleted after the Resumed Point is removed. ROB ROB can be added separately for both the Starting Point and the Resumed Point. Adding the ROB Details Follow the steps below to add a ROB detail: Click the arrow to expand the Starting Point; this will open a separate section for entering ROB details. Click on the \"+ New ROB\" button. This will open up the Add ROB screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the ROB Details Follow the steps below to modify the details of ROB: Hover over the required ROB. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit ROB screen. Change the required details. Click the \"Update\" button. Deleting the ROB Details Follow the steps below to delete the details of ROB: Hover over the required ROB.  The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up confirmation pop up screen. Click \"Yes Proceed\" button Note - The same process to add, edit, and delete ROB details is followed for the Resumed Point as well. Summary This page provides basic downtime details such as downtime hours and distance covered. It also includes two sections: Analysis , which shows the reason for downtime with calculated hours, and Consumptions , which displays fuel oil details—like type, bunker received, bunker adjusted, downtime consumption, and the difference—in a tabular format. Downtime hours and distance covered are auto-calculated, while consumption details are view-only on this page. Analysis Modifying the Analysis Details Click the Edit button under Analysis section. Change the required details. Click the \"Update\" button. Note - Consumptions The Consumptions details re view-only on this page. Modifying the Superintendent Remarks Follow the steps given below to modify the remarks Click the Edit button under Remarks sections. Change the required details. Click the \"Update\" button. Documents Adding the Document Follow the steps below to add a new Document details: Click on the \"Upload\" button. This will open up the Add Document screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Document Details Follow the steps below to modify the required Document Details: Hover over the required Document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Edit\" option. This will open the Edit Documents screen. Change the required details. Click the \"Update\" button. Viewing the Document Details Follow the steps below to view the Document: Click on the required attached document where the hyperlink is given for which you want to view the details. This will open the View Documents page in read-only mode. Click the \"Close\" button to exit. Deleting the Document Follow the steps below to delete the Document: Hover over the required Document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Audit Log This page shows the audit log of the Downtime with their user details, log details and description. You can navigate through Operations > Deviation and Downtime > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the log details: Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. . Click the \"Close\" button to exit. Changing the Downtime Status The status can be configured through workflows based on specific requirements, allowing for a structured and customized approval process. This ensures that status changes align with operational needs and predefined workflow rules. Remember - The applicable status and revert status can be configured as per requirements and managed through the workflow with its privileges. Follow the steps below to change the status of Downtime Hover over the required Downtime. The 3 Dot icon appears to reveal the Applicable Status, and Delete options. Click the 3 Dot Icon and select the \"Applicable Status\" option. Change the required status. Note - The status will be shown from the workflow based on the requirement and its privilege. Deleting the Downtime Follow the steps below to delete the Downtime: Hover over the required Downtime. The 3 Dot icon appears to reveal the Current Status and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
        "children": []
      },
      {
        "title": "Environmental Reports",
        "id": 198,
        "content": "Environmental Reports track a vessel’s halocarbon use and discharges to help ensure it follows environmental regulations. ",
        "children": [
          {
            "title": "Vessel Halocarbons",
            "id": 200,
            "content": "Halocarbons Inventory is a record of the types and amounts of halocarbon gases used, stored, released, or recovered—mainly for environmental tracking and compliance. You can access the Vessel Halocarbons page from here: Explorer Menu > Operations > Environmental Reports > Vessel Halocarbons Finding the Vessel Halocarbon of Each Vessel Follow the steps below to search the required Vessel Halocarbon: Select the required Vessels / Types / Fleets / Classes / Groups, Halocarbons and Halocarbon System in the search field. Click the \"Search\" button. The system displays a list of vessels, including details of their associated halocarbon usage and records . This page provides complete details of the halocarbon inventory, including vessel name, halocarbon type, system, quantity in service, quantity in stock, ROB (Remaining Onboard), updated on, and updated by. You can also Add/Register, Delete, and Access the inventory details of each vessel halocarbon. The following information is mandatory for registering a new Vessel Halocarbon: Vessel Name Halocarbon System Halocarbon Date Quantity In Stock Quantity In Service Remarks Registering the Vessel Halocarbon Follow the steps below to register a new Vessel Halocarbon: Click on the \"+ New\" button. This will open up the Register Vessel Halocarbon screen. Fill in the required details. Make sure to fill all the mandatory fields. Click the \"Save\" button. Viewing the Vessel Halocarbon Details Follow the steps below to view the required Vessel Halocarbon details: Click on the required Vessel Name where the hyperlink is given. The system will display the transactions page by default. Adding the Transaction Follow the steps below to add a new Transaction: Click on the \"+ New\" button. This will open up the Add Transaction screen. Fill in the required details. Make sure to fill all the mandatory fields. Click the \"Save\" button. Modifying the Transaction Follow the steps below to modify the required transaction: Hover over the required Date. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit Transaction screen. Change the required details. Click the \"Update\" button. (Note - Only the most recent entry can be edited or deleted.  Only for the first transaction, the ROB will be the same as the previous ROB. From the second transaction onward, the previous ROB will be carried forward from the ROB of the first transaction. When all transactions associated with a specific halocarbon are deleted, the system will automatically delete the halocarbon record as well.) Deleting the Transaction Follow the steps below to delete the required Transaction: Hover over the required Date. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Audit Log This page shows the audit log of the Transactions with their user details, log details and description. You can navigate through: Operations > Environmental Reports > Vessel Halocarbons > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the log details: Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. Click the \"Close\" button to exit. Deleting the Vessel Halocarbon Follow the steps below to delete the required vessel halocarbon: Hover over the required Vessel. The 3 Dot icon appears to reveal the Delete option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
            "children": []
          },
          {
            "title": "Discharges",
            "id": 201,
            "content": "You can access the Discharges page from here: Explorer Menu > Operations > Environmental Reports > Discharges Finding the Discharge of Each Vessel Follow the steps below to search the required Discharge: Select the required Vessels / Types / Fleets / Classes / Groups, From Date, To Date, Discharge Item, Discharge Method, Discharge Category and Status in the search field. Click the \"Search\" button. The system displays a list of vessels, including details of their associated discharges and records. This page provides complete details of the discharges in a card view, including Vessel Name, Status, Voyage Number, Date, Discharge Item, Discharge Method, Discharge Category, Volume before m3 and Volume after m3. You can also Add, Delete, Change the status, View Status History and Access the details of each discharge. The following information are mandatory for adding a new Discharge: Vessel Name Date Voyage Number Discharge Item Discharge Method Discharge Category Master Chief Engineer Compactor Used Volume before m3 Volume after m3 Remarks Adding the Discharge details Follow the steps below to add a New Discharge detail: Click on the \"+ New\" button. This will open up the Add Discharge screen. Fill in the required details. Make sure to fill all the mandatory fields. Click the \"Save\" button. Accessing the Vessel Discharge Details Follow the steps below to view the required Vessel Discharge details: Click on the required card where the hyperlink is given. The system will display the details page by default. Modifying the Discharge details Follow the steps below to modify the required discharge detail: Click on the required card where the hyperlink is given. The system will display the details page by default. Click the Edit button. Change the required details. Click the \"Update\" button. Documents This page provides details of the attached documents required for a particular Discharge details where you can upload, edit, view and delete. Adding a New Document Follow the steps below to add a new Document: Click on the \"Upload\" button. This will open up the Add Document screen. Add the Document description with required number of files. Click the \" Save\" button. Modifying the Document Follow the steps below to modify the Document: Hover over the required document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Edit\" option. This will open the Edit Documents screen where the attachments can be added or removed. Change the required details. Click the \"Update\" button. Viewing the Document Follow the steps below to view the Document: Click on the required attached document where the hyperlink is given for which you want to view the details. This will open the view documents page in read-only mode. Click the \"Close\" button to exit. Remember - You can save or print the required document from here. Deleting the Document Follow the steps below to delete the Document: Hover over the required document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete . Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Audit Log This page shows the audit log of the Transactions with their user details, log details and description. You can navigate through: Operations > Environmental Reports > Discharges > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the log details: Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. Click the \"Close\" button to exit. Changing the Discharge Status The status can be configured through workflows based on specific requirements, allowing for a structured and customized approval process. This ensures that status changes align with operational needs and predefined workflow rules. Remember - The applicable status and revert status can be configured as per requirements and managed through the workflow with its privileges. Follow the steps below to change the status of required Discharge Status. Hover over the required card. The 3 dot icon appears to reveal the Applicable Status, and Delete options. Click the 3 Dot Icon and select the \"Applicable Status\" option. Note - The status will be shown from the workflow based on the requirement and its privilege. Change the required status. This will show the confirmation message for each status change. Viewing the Status History Follow the steps below to view the required status details: Click on the required Discharge Status where the hyperlink is given. This will open up the Status history details screen. Click the \"Close\" icon to exit. Deleting the Vessel Discharge detail Follow the steps below to delete the required vessel discharge: Hover over the required Vessel Discharge. The 3 Dot icon appears to reveal the Delete option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
            "children": []
          }
        ]
      },
      {
        "title": "High Risk Transits",
        "id": 199,
        "content": "High-risk transit refers to the movement of a vessel through a geographic area where there is an increased threat to the safety of the ship, its crew, or its cargo. You can access the High Risk Transit page from here: Explorer Menu > Operations > High Risk Transit Finding the High Risk Transit of Each Vessel Follow the steps below to search the required High-Risk Transit s: Select the required Vessels / Types / Fleets / Classes / Groups, Area, Voyage Number, Start Date and End Date in the search field. Click the \"Search\" button. The system provides a list of vessels, including detailed records of their High-Risk Transit activities. T his page displays comprehensive information about a vessel’s high-risk transit, covering the Vessel Name, Voyage Number, Entry Date with time, Exit Date with time, Area, Entry Location, Exit Locations, Number of Days, and Current Status. The following information is mandatory for adding a new High-Risk Transit : Vessel Name Area Voyage Number Entry Date Entry Location Exit Date Exit Location Remarks Adding the High Risk Transit Follow the steps below to add a new High-Risk Transit : Click on the \"+ New\" button. This will open up the Add High-Risk Transit screen. Fill in the required details. Make sure to fill all the mandatory fields. Click the \"Save\" button. Modifying the High Risk Transit Follow the steps below to modify the required High-Risk Transit: Hover over the required Vessel. The 3 Dot icon appears to reveal the Applicable Status, Edit, Delete and History option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up the Edit High-Risk Transit screen. Change the required details. Click the \"Update\" button. Note - The vessel field will be disabled in Edit screen. Deleting the High Risk Transit Follow the steps below to delete the required High-Risk Transit: Hover over the required Vessel. The 3 Dot icon appears to reveal the Applicable Status, Edit, Delete and History option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Viewing the History Details This page shows the history details of each high-risk transit. The log records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Follow the steps below to view the required history details: Hover over the required Vessel. The 3 Dot icon appears to reveal the Applicable Status, Edit, Delete and History option. Click the 3 Dot Icon and select the \"History\" option. This will open up the High-Risk Transit History details screen. Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log details. Click the \"Close\" button to exit. Changing the High Risk Transit Status The status can be configured through workflows based on specific requirements, allowing for a structured and customized approval process. This ensures that status changes align with operational needs and predefined workflow rules. Remember - The applicable status and revert status can be configured as per requirements and managed through the workflow with its privileges. Follow the steps below to change the status of required high-risk transit: Hover over the required Vessel. The 3 Dot icon appears to reveal the Applicable Status, Edit, Delete and History option. Click the 3 Dot Icon and select the \"Applicable Status\" option. Note - The status will be shown from the workflow based on the requirement and its privilege. Change the required status. This will show the confirmation message for each status change. Viewing the Status History Follow the steps below to view the required status details: Click on the required High-Risk Transit Status where the hyperlink is given. This will open up the Status history details screen. Click the \"Close\" icon to exit. ",
        "children": []
      }
    ]
  }