
  {
    "title": "Technical Module",
    "id": 42,
    "content": "This module is responsible for recording and managing technical details and operations of a vessel like Vessel Particulars, Vessel Budgets, Vessel Inspections, Contractor Exposure, Vessel PIQ, and MSQA Inspection . Registers - Registers serve as the primary control point for managing vessel details, ensuring accurate documentation and seamless data management across various categories like Vessel Particulars Vessel Budgets Vessel PIQ Vessel Inspections Contractor Exposure MSQA Inspections Navigating to Technical Register You can access the Vessel Particulars page from here :  Explorer Menu -> Technical Additionally, you can navigate through other submodules, including - Vessel Particulars, Vessel Budgets, Vessel Inspections, Contractor Exposure, Vessel PIQ, and MSQA Inspection . ",
    "children": [
      {
        "title": "Vessel Particulars",
        "id": 101,
        "content": "The Vessel Particulars page is provided to maintain all generic and technical information pertaining to a registered vessel. Any vessel used in any part of the system should be first registered here. All the key information that are stored among the various modules can be viewed here. Note - First you need to register the Vessel Name under the Vessel Register in Master Data before you can update the vessel particulars. You can access the Vessel Particulars page from here :  Explorer Menu > Technical > Vessel Particulars Finding a Particular of Each Vessel Follow the steps below to search the required Vessel Particular details: Select the required Vessel Name, Vessel Type, Vessel Class, Vessel Groups or Vessel Status or Vessel Flag in the search field. Click the \"Search\" button. The system will display the list of the required Vessel Particulars. Viewing the Detail of Each Vessel Follow the steps below to view the required Vessel Particular details: a. Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particular details screen. b. Click the \"Back\" button or the \"Vessel Particulars\" given on the breadcrumbs which leads to the search and list page. Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
        "children": [
          {
            "title": "Vessel Particular Details tab ",
            "id": 137,
            "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars - General tab by default. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
            "children": [
              {
                "title": "General ",
                "id": 138,
                "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars - General tab by default. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Identification Numbers",
                "id": 139,
                "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars - General tab by default. Navigate to the required Identification Numbers side tab Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Important Dates",
                "id": 140,
                "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars - General tab by default. Navigate to the required Important Dates side tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Speed and Consumption",
                "id": 141,
                "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars - General tab by default. Navigate to the required Speed and Consumption side tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Safety",
                "id": 142,
                "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars General tab by default. Navigate to the required Safety tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Construction Related",
                "id": 143,
                "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars - General tab by default. Navigate to the required Construction Related side tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Cargo",
                "id": 144,
                "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars - General tab by default. Navigate to the required Cargo side tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Ballast",
                "id": 145,
                "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars - General tab by default. Navigate to the required Ballast side tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Anchoring and Mooring",
                "id": 146,
                "content": "Modifying the Vessel Particular Details Follow the steps below to modify the required Vessel Particular details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars - General tab by default. Navigate to the required Anchoring and Mooring side tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              }
            ]
          },
          {
            "title": "Technical Details",
            "id": 147,
            "content": "Modifying the Technical Details Follow the steps below to modify the required Technical details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars tab. Navigate to the Technical details. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
            "children": [
              {
                "title": "Engine Related",
                "id": 148,
                "content": "This page provides comprehensive details related to the engine, including the Main Engine Manufacturer, Model, Propeller Pitch Type, Propeller Mean Pitch, and various Maximum Continuous Rating (MCR) Parameters (MCR ME, MCR Limited, MCR #1, MCR #2, MCR #3, MCR #4, MCR Emergency/Harbour Generator, and MCR Shaft Generator), as well as the Average Cylinder Oil Consumption. Modifying the Technical Details Follow the steps below to modify the required Technical details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars tab. Navigate to the Technical details where the Engine Related side tab is opened by default. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Environmental",
                "id": 149,
                "content": "This page displays environmental details, including Scrubber Installation Status, Scrubber Type, SCR (Selective Catalytic Reduction) System, SCR Type, NOx Control Level Tier, Sewage Treatment System Capacity, BWTS (Ballast Water Treatment System) Manufacturer and Type, as well as CII (Carbon Intensity Indicator) for the previous year, EEXI (Energy Efficiency Existing Ship Index), and EEDI (Energy Efficiency Design Index). Modifying the Technical Details Follow the steps below to modify the required Technical details. Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars tab. Navigate to the Technical details and click on the required Environmental side tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. ",
                "children": []
              },
              {
                "title": "Capacities",
                "id": 150,
                "content": "This page provides the capacity details of cylinder lube oil, Dead Weight (DW) Capacity, Fresh Water Capacity, and Fuel Capacities along with their respective types, as well as information on the last update, including the updated by and updated on details Modifying the Technical Details Follow the steps below to modify the required Technical details. Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particulars tab. Navigate to the Technical details and click on the required Capacities side tab. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. Note - Under the \"General\" side tab, the \"Yard Built\" field should be completed first before entering information in the other fields within the side tabs. Modifying the Capacity Details Follow the steps below to modify the Capacity details : Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Technical details and click on the required Capacities side tab Click the \" Edit\" button. Change the required details . Click the \"Update\" button. Adding the Fuel Capacity Details Note - You can Add, Edit, View and Delete the capacity for Fuel from this section. The following information are mandatory for Adding a new Fuel Capacity: Fuel Type Fuel Capacity Follow the steps below to Add the Fuel Capacity details Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Technical details and click on the required Capacities side tab. Click the \" + New\" button. Fill in the required details . Click the \"Save\" button. Modifying the Fuel Capacity Details Follow the steps below to modify the Capacity details: Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Technical details and click on the required Capacities side tab. Hover the required Fuel Type. The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \"Edit\" option.  This will open up the Edit Fuel Capacity screen. Change the required details . Click the \"Update\" button. Note - The Capacity Field can be modified, while the F uel Type remains disabled. Viewing the Fuel Capacity Details Follow the steps below to view the Capacity details: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Technical details and click on the required Capacities side tab. Click on the required Fuel Type for which the hyperlink is given. This will open the  View Fuel Capacity details page in read-only mode. Click the \"Close\" button or icon to exit. Deleting the Fuel Capacity Details Follow the steps below to delete the Capacity details : Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Technical details and click on the required Capacities side tab Hover the required Fuel Type. The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
                "children": []
              }
            ]
          },
          {
            "title": "Management Details",
            "id": 158,
            "content": "How to manage the Management Details of a Vessel? This page shows us the  complete record of a vessel's management history: Present Management Details – Includes Start and End Dates, Estimated Departure Date, and Previous Manager. Management History – Shows Previous Name, Name Change Date, Previous Owner, Owner Change Date, Previous Flag, and Flag Change Date. Modifying the Management Details Follow the steps below to modify the Management details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particular details screen. Navigate to the Management tab. Click the \" Edit\" button. Change the required details . Click the \"Update\" button. ",
            "children": []
          },
          {
            "title": "Communication ",
            "id": 159,
            "content": "How to manage the Communication Details of a Vessel? This page provides various communication details of a specific vessel where you can Add, Edit and Delete the Communication Details . The following information is mandatory for adding a new Communication Type: Communication Type Communication Number Remarks Archived Note: Certain common functions, such as pagination, download, sorting, and archived , are available exclusively within table data. The table data encompasses the Communication tab, Technical (Capacities), Contacts, Tanks, Sea Trials, Anti-Fouling, and Equipment Configuration . A flag is displayed in the table to indicate that a remark has been added for the communication type. When hovered over, a tooltip reveals the remark in its expanded form. Adding the Communication Type Follow the steps below to Add the Communication Type details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particular details screen. Navigate to the Communication tab. Click the \" + New\" button. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Communication Details Follow the steps below to modify the Communication details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particular details screen. Navigate to the Communication tab. Hover over the required Communication Type. The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Edit\" option. This will open up the Edit Vessel Communication screen. Change the required details. Click the \"Update\" button. Deleting the Communication Details Follow the steps below to delete the Communication details: Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Communication  tab. Hover over the required Communication Type. The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
            "children": []
          },
          {
            "title": "Contacts ",
            "id": 160,
            "content": "How to manage the Contact Details of a Vessel? This page provides complete contact details of a person, including name, role, mobile number, email ID, effective date, updated by, and updated on where you can Add, Edit and Delete the Contact Details . The following information is mandatory for adding a new Office Contact / Responsible Person Details: Role Name Effective From Archived Note: Certain common functions, such as pagination, download, sorting, and archived , are available exclusively within table data. Adding the Contact Details Follow the steps below to Add the Office Contact / Responsible Person details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particular details screen. Navigate to the Contacts tab. Click the \" + New\" button. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Contact Details Follow the steps below to modify the Office Contact / Responsible Person details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particular details screen. Navigate to the Contacts tab. Hover over the required Contact details . The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Edit\" option. This will open up the Edit Vessel Office Contact / Responsible screen. Change the required details . Click the \"Update\" button. Deleting the Contact Details Follow the steps below to delete the Office Contact / Responsible Person details : Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Contacts  tab. Hover over the required Contacts details. The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
            "children": []
          },
          {
            "title": "Tanks ",
            "id": 161,
            "content": "How to manage the Tank Details of a Vessel? You can Add, Edit , View, and Delete the Tank Details. The following information is mandatory for Adding a new Tank Details: Tank Type Compartment Volume 100% Weight Volume 98% Volume 95% Density Steam Coil Level Gauging Used for Sounding test Used for slop Remarks Note: Certain common functions, such as pagination, download, sorting, and archived , are available exclusively within table data. Adding the Tank Details Follow the steps below to Add the Tank details: Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Tank tab. Click the \" + New\" button. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Viewing the Tank Details Follow the steps below to view the Tank details : Click on the required Vessel Name where the hyperlink is given. This will open the Vessel Particular details screen. Navigate to the Tanks tab. Navigate to the appropriate Tank Type side tab. Click on the Compartment where the hyperlink is given. This will open the  View vessel Tank details screen in read-only mode. Click the \"Close\" button or icon to exit. Modifying the Tank Details Follow the steps below to modify the Tank details Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Tanks tab. Navigate to the appropriate Tank Type sub tab. Hover over the required Compartment . The 3 dot icon appears to reveal the Show Oil Types, Oil Present, Edit and Delete options. Click the 3 Dot Icon and select the \" Edit\" option. This will open the Edit vessel tank screen. Change the required details . Click the \"Update\" button. Note - You can edit only specific fields based on the selected tank type. Not all fields can be edited in this screen. Showing Oil Types under Tank Details Follow the steps below to show the Oil Types under Tank details Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Tanks tab. Navigate to the appropriate Tank Type sub tab. Hover over the required Compartment . The 3 dot icon appears to reveal the Show Oil Types, Oil Present, Edit and Delete options. Click the 3 Dot Icon and select the \" Show Oil Types\" option. This will open the oil types pop up screen. Select the required F uel Oil Type to be added. Click \" Save\" button. Note - The oil type displayed here is sourced from Technical - Capacities . Deleting the Tank Details Follow the steps below to delete the Tank details: Click on the required Vessel Name where the hyperlink is given. This will open the  Vessel Particular details screen. Navigate to the Tanks tab. Navigate to the appropriate Tank Type sub tab. Hover over the required Compartment . The 3 dot icon appears to reveal the Show Oil Types, Oil Present, Edit and Delete options. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
            "children": []
          },
          {
            "title": "Sea Trials",
            "id": 162,
            "content": "How to manage the Sea Trial  Information of a Vessel? You can Add, Edit and Delete the Sea Trial Information. The following information is mandatory for Adding a new Sea Trial Information: Sea Trial Date Engine Barred Speed Min (RPM) Barred Speed Max (RPM) Note: Certain common functions, such as pagination, download, and sorting are available exclusively within table data. Adding the Sea Trial Information Follow the steps below to Add the Sea Trial Information: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Sea Trials tab. Click the \" + New\" button. Fill in the required details . Click the \"Save\" button. Modifying the Sea Trial Information Follow the steps below to modify the Sea Trial Information : Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Sea Trials tab. Hover over the required date . The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Edit\" option. Change the required details . Click the \"Update\" button. Deleting the Sea Trial Information Follow the steps below to delete the Sea Trial Information : Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Sea Trials tab. Hover over the required date . The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Delete\" option. Click \"Yes Proceed\" button. Viewing the Sea Trial Details Follow the steps below to view the Sea Trial details : Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Sea Trials tab. Click on the check box of the required Date. This will open up the Sea Trial Details Page where we can Add, Edit, View and Delete the Vessel Sea Trial Items. The following information are mandatory for Adding a new Vessel Sea Trial Items: Load Tier Power RPM Speed SFOC Fuel Consumption Daily Fuel Consumption Hourly Draft FWD Draft AFT Dead Weight Remarks Adding a Vessel Sea Trial Item Follow the steps below to add the Sea Trial Items: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Sea Trials tab. Click on the check box of the required Date. This will open up the Sea Trial Details Page where we can Add, Edit, View and Delete the Vessel Sea Trial Items. Click the \"+ New \" button. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Viewing a Vessel Sea Trial Item Follow the steps below to view the Sea Trial Item: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Sea Trials tab. Click on the check box of the required Date. This will open up the Sea Trial Details Page where we can Add, Edit, View and Delete the Vessel Sea Trial Items. Click on the required Load % where the hyperlink is given. This will open the  View Vessel Sea Trial Item screen in read-only mode. Click the \"Close\" button or icon to exit. Modifying a Vessel Sea Trial Item Follow the steps below to modify the Sea Trial Item: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Sea Trials tab. Click on the check box of the required Date. This will open up the Sea Trial Details Page where we can Add, Edit, View and Delete the Vessel Sea Trial Items. Hover over the required Load% . The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Edit\" option. This will open up the Edit vessel sea trial item screen. Change the required details . Click the \"Update\" button. Deleting a Vessel Sea Trial Item Follow the steps below to delete the Sea Trial Item: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Sea Trials tab. Click on the check box of the required Date. This will open up the Sea Trial Details Page where we can Add, Edit, View and Delete the Vessel Sea Trial Items. Hover over the required Load% . The 3 dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
            "children": []
          },
          {
            "title": "Anti-Foulings",
            "id": 163,
            "content": "How to manage the Anti-Fouling details of a Vessel? You can Add, Edit, View and Delete the Anti-fouling Details. The following information is mandatory for Adding a new Anti-fouling: Yard Name Start Date End Date Remarks Note: Certain common functions, such as pagination, download and sorting are available exclusively within table data. Adding the Anti-fouling Details Follow the steps below to Add the Anti-fouling details: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Anti-fouling tab. Click the \" + New\" button. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Viewing the Anti-fouling Details Follow the steps below to view the Anti-fouling details: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Anti-fouling tab. Click on the required Yard Name where the hyperlink is given. This will open up the View Anti-fouling Details screen in read-only mode. Click the \"Close\" button to exit. Modifying the Anti-fouling Details Follow the steps below to modify the Anti-fouling details: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Anti-fouling tab. Hover over the required Yard Name. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Edit\" option.  This will open the Edit Anti Fouling screen. Change the required details. Click the \"Update\" button. Deleting the Anti-fouling Details Follow the steps below to delete the Anti-fouling details: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Anti-fouling tab. Hover over the required Yard Name. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Accessing Paint Details Through Anti-Fouling Selection Follow the steps below to view the Paint Details through the Anti-fouling selection: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Anti-fouling tab. Click on the check box of the required Yard Name. This will open up the Paint Details Page where we can Add, Edit, View and Delete . The following information are mandatory for Adding a new Paint Details: Paint Type Paint Maker Life Paint Surface Preparation Type SPB with Tie Coat DFT Upto Draft Remarks Adding the Paint Details Follow the steps below to add the Paint Details: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Anti-fouling tab. Click on the check box of the required Yard Name. This will open up the Paint Details Page where we can Add, Edit, View and Delete . Click the \"+ New \" button. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Viewing the Paint Details Follow the steps below to view the Paint detail: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Anti-fouling tab. Click on the check box of the required Yard Name. This will open up the Paint Details Page where we can Add, Edit, View and Delete . Click on the required Maker where the hyperlink is given. This will open up the View Paint Details screen in read-only mode. Click the \"Close\" button to exit. Modifying the Paint Details Follow the steps below to modify the Paint detail: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Anti-fouling tab. Click on the check box of the required Yard Name. This will open up the Paint Details Page where we can Add, Edit, View and Delete . Hover over the required Maker. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Edit\" option. This will open the Edit Paint screen. Change the required details. Click the \"Update\" button. Deleting the Paint Details Follow the steps below to delete the Paint detail: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Anti-fouling tab. Click on the check box of the required Yard Name. This will open up the Paint Details Page where we can Add, Edit, View and Delete. Hover over the required Maker. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \" Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
            "children": []
          },
          {
            "title": "Equipment Configuration",
            "id": 164,
            "content": "How to manage the Equipment Configuration details of a Vessel? You can Add, Edit, and Delete the Equipment Configuration Details. You can remove or copy the Equipment Configuration from a selected vessel and reassign it to one or multiple vessels. This function can be performed individually or as a group . The following information is mandatory for Adding a new Equipment Configuration: Equipment Type Equipment Count / No. of Units Archived (Toggle Button) Applicable Oil Applicable Activities Note: Certain common functions, such as pagination, download, and sorting are available exclusively within table data. Adding the Equipment Configuration Details Follow the steps below to Add the Equipment Configuration details: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Equipment Configuration tab. Click the \" + New\" button. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Equipment Configuration Details Follow the steps below to modify the Equipment Configuration details: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Equipment Config. tab. Hover over the required Equipment Type. The 3 dot icon appears to reveal the Copy to Vessel, Remove Vessel, Edit and Delete options. Click the 3 Dot Icon and select the \" Edit\" option. This will open up the Edit Equipment Configuration screen. Change the required details . Click the \"Update\" button. Deleting the Equipment Configuration Details Follow the steps below to delete the Equipment Configuration details: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Equipment Config tab. Hover over the required Equipment Type. The 3 dot icon appears to reveal the Copy to Vessel, Remove Vessel, Edit and Delete options. Click the 3 Dot Icon and select the \" Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Viewing the Equipment Configuration Details Follow the steps below to view the Equipment Configuration details: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Equipment Config. tab. Click on the required Equipment Type where the hyperlink is given. This will open up the  View Equipment Type Details screen in read-only mode. Click the \"Close\" button or icon to exit. Copying  an Equipment Type to Vessel Follow the steps below to copy an Equipment Configuration details: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Equipment Config. tab. Hover over the required Equipment Type. The 3 dot icon appears to reveal the Copy to Vessel, Remove Vessel, Edit and Delete options. Click the 3 Dot Icon and select the \" Copy to Vessel\" option. Select the required vessels (can select 1 or more than 1 vessel) . Click the \"Save\" button. Note - There is a Toggle Button for Replacing the Existing Equipment. Copying Multiple Equipment Type to Vessel Follow the steps below to copy Multiple Equipment Configuration details: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Equipment Config. tab. Select multiple Equipment Type. Click the 3 Dot Icon next to the \"+ New\" Button and select the \" Copy to Vessel\" option. Select the required vessels Click the \"Save\" button. Removing an Equipment Type from Vessel Follow the steps below to remove the Equipment Configuration details: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Equipment Config. tab. Hover over the required Equipment Type. The 3 dot icon appears to reveal the Copy to Vessel, Remove Vessel, Edit and Delete options. Click the 3 Dot Icon and select the \" Remove Vessel\" option. Select the required vessels (can select 1 or more than 1 vessel) . Click the \"Save\" button. Removing Multiple Equipment Type from Vessel Follow the steps below to remove Multiple Equipment Configuration details: Click on the required Vessel Name where the hyperlink is given. This will open up the  Vessel Particular details screen. Navigate to the Equipment Config. tab. Select multiple Equipment Type. Click the 3 Dot Icon next to the \"+ New\" Button and select the \" Remove Vessel\" option. Select the required vessels. Click the \"Save\" button. ",
            "children": []
          },
          {
            "title": "Audit Log",
            "id": 165,
            "content": "This page shows the audit log of the vessel particulars with their user details, log details and description. Note: Certain common functions, such as pagination, and download are available exclusively within table data. You can navigate through Technical > Vessel Particulars > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the log details: Click on the required Vessel Name where the hyperlink is given. This will open up the Vessel Particular details screen. Navigate to the Audit Log tab. Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. Click the \"Close\" button to exit. ",
            "children": []
          }
        ]
      },
      {
        "title": "Contractor Exposure",
        "id": 167,
        "content": "All outsourced work is recorded under contract exposure management to track cost, service providers, work scope, duration and compliance. Proper documentation ensures accountability, cost control and risk mitigation. Contract exposure records track costs, providers, work scope and compliance. You can add, edit, change status and view history for better accountability and control. You can access the Contractor Exposure page from here: Explorer Menu > Technical > Contractor Exposure Finding the Contractor Exposure Hours of Each Vessel Follow the steps below to search the required Contractor Exposure Hours: Select the required Vessel / Class / Type / Group, Year, Month, No. Of Hours and Status in the search field. Click the \"Search\" button. The system will display the list of the required list of Vessel with their Contractor Exposure Hours. This page provides complete details of a vessel, including the year, month, no. of hours, created by and status where you can Add, Edit, Delete, view, change the status, and history of each contractor exposure hour. The following information is mandatory for adding a new Contractor Exposure Hours: Vessel Name Year Month No. Of hours Adding the Contractor Exposure Hours Follow the steps below to add a new Contractor Exposure Hour: Click on the \"+ New\" button. This will open up the Add Contractor Exposure Hours screen. Fill in the required details. Click the \"Save\" button. Modifying the Contractor Exposure Hours Follow the steps below to modify the required contractor exposure hours: Hover over the required Vessel. The 3 Dot icon appears to reveal the Applicable Status, Edit, Delete and History option. Click the 3 Dot Icon and select the \"Edit\" option. This will open up Edit Contract Exposure screen. Change the required details. Click the \"Update\" button. Deleting the Contractor Exposure Hours Follow the steps below to delete the required contractor exposure hours: Hover over the required Vessel. The 3 Dot icon appears to reveal the Applicable Status, Edit, Delete and History option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Viewing the History Details This page shows us the history details of each contractor exposure hour. The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Follow the steps below to view the required history details: Hover over the required Vessel. The 3 Dot icon appears to reveal the Applicable Status, Edit, Delete and History option. Click the 3 Dot Icon and select the \"History\" option. This will open up the Contractor Exposure History details screen. Click on the required particular transaction. This will open up the View Details screen in read-only mode which shows the log data and log details. Click the \"Close\" button to exit. Changing the Contractor Exposure Hours Status The status can be configured through workflows based on specific requirements, allowing for a structured and customized approval process. This ensures that status changes align with operational needs and predefined workflow rules. Remember - The applicable status and revert status can be configured as per requirements and managed through the workflow with its privileges. Follow the steps below to change the status of required contractor exposure hours: Hover over the required Vessel. The 3 Dot icon appears to reveal the Applicable Status, Edit, Delete and History option. Click the 3 Dot Icon and select the \"Applicable Status\" option. Note - The status will be shown from the workflow based on the requirement and its privilege. Change the required status. This will show the confirmation message for each status change. Viewing the Status History Follow the steps below to view the required status details: Click on the required Contractor Exposure Status where the hyperlink is given. This will open up the Status history details screen. Click the \"Close\" icon to exit. ",
        "children": []
      },
      {
        "title": "Vessel PIQ",
        "id": 170,
        "content": "A Vessel PIQ (Pre-Inspection Questionnaire) is a form used before inspecting a ship. It collects important details about the vessel, like its specifications, safety equipment, crew, maintenance history, and compliance with regulations. The goal is to identify potential issues and ensure the vessel is ready for a full inspection. This helps streamline the process and make sure the ship meets all necessary standards. A Vessel (Pre-Inspection Questionnaire) also known as PIQ is a feature that helps the user to create a pre inspection questionnaire for production pre inspection before the main inspection. You can access the Vessel PIQ page from here :  Explorer Menu > Technical > Vessel PIQ Finding the Vessel PIQ for Each Vessel Follow the steps below to search the required Vessel PIQ: Select the required Vessels / Types / Classes / Groups, From Date, To Date and Status in the search field. Click the \"Search\" button. The system will display the list of the required Vessel PIQ. The page displays the list of vessels in a tabular format, with columns for Vessel Name, Vessel Type, Description, Date, Created by and Status of each PIQ. To Add a new Vessel PIQ, the following information is required: Vessel Name Description. Adding the Vessel PIQ Follow the steps below to add a new Vessel PIQ: Click on the \"+ New\" button. This will open up the Add PIQ screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the Vessel PIQ Follow the steps below to modify the Vessel PIQ: Hover over the required Vessel. The 3 dot icon appears to reveal the Applicable Status, Edit, Delete, and Print options. Click the 3 Dot Icon and select the \"Edit\" option. This will open up the Edit PIQ screen. Change the required details. Click the \"Update\" button. Printing the Vessel PIQ Follow the steps below to print the Vessel PIQ: Hover over the required Vessel. The 3 dot icon appears to reveal the Applicable Status, Edit, Delete, and Print options. Click the 3 Dot Icon and select the \"Print\" option. This will open up the print preview screen. Click the \"Print\" button to get a copy. Deleting the Vessel PIQ Follow the steps below to delete the Vessel PIQ: Hover over the required Vessel. The 3 dot icon appears to reveal the Applicable Status, Edit, Delete, and Print options. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Viewing the details of Vessel PIQ Follow the steps below to view the Vessel PIQ details: Click on the required Vessel Name where the hyperlink is given. This will open the Vessel PIQ details tab by default. The page has two sections: one shows the PIQ chapters, and the other shows a card view with multiple sections under each chapter. Each section can be expanded to view questions under the respective sections. Modifying the Section Details of Each Chapter Follow the steps below to modify the section details of each chapter: Click on the desired chapter to open the corresponding section. Click the arrow icon to expand the corresponding section. Click the Edit button. Change the required details. Click the \"Update\" button. Audit Log This page shows the audit log of the Vessel PIQ with their user details, log details and description. You can navigate through Technical >Vessel PIQ > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the log details: Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. . Click the \"Close\" button to exit. Changing the Vessel PIQ Status The status can be configured through workflows based on specific requirements, allowing for a structured and customized approval process. This ensures that status changes align with operational needs and predefined workflow rules. Remember - The applicable status and revert status can be configured as per requirements and managed through the workflow with its privileges. Follow the steps below to change the status of Vessel PIQ: Hover over the required Vessel. The 3dot icon appears to reveal the Applicable Status, Edit, Delete, and History options. Click the 3 Dot Icon and select the \"Applicable Status\" option. Note - The status will be shown from the workflow based on the requirement and its privilege. Change the required status. This will show the confirmation message for each status change. Viewing the Status History Follow the steps below to view the required status details: Click on the required Vessel PIQ Status where the hyperlink is given. This will open up the Status history details screen. Click the \"Close\" icon to exit. ",
        "children": []
      },
      {
        "title": "Vessel Inspections",
        "id": 172,
        "content": "A Vessel Inspection is a safety check to ensure a ship or industrial tank is in good condition and meets regulations. It helps to find issues like leaks, cracks, or corrosion to prevent accidents. You can access the Vessel Inspection page from here : Explorer Menu > Technical > Vessel Inspections Finding a Particular Vessel Inspection Follow the steps below to search the required Vessel Inspection details: Select the required Vessels, Types, Classes, Groups or Inspection Type or Company or Inspector Type or Start Date or End Date or Status or Other Filters in the search field. Click the \"Search\" button. The system will display the list of the required Vessel Inspections. This page displays vessel inspection details in a table format, including columns such as Vessel Name, Start Date, Inspection Type, Company, Inspector Type, Port Name, Total Findings, Open Findings, Overdue, Due in 2 Weeks, Due in a Month, Created by and Status. The following information is mandatory for adding a new Vessel Inspection: Vessel Name Inspection Type Inspector Type Company Start Port End Port Start Date End Date Master Chief Engineer Inspector Office Support Person Sailing Inspector Qualification Inspector Details Adding the Vessel Inspection Follow the steps given below to add a new Vessel Inspection: Click on the \"+ New\" button. This will open up the Add Inspection details screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Viewing the Detail of Each Vessel Inspection Follow the steps below to view the required Vessel Inspection details: Click on the required Start Date where the hyperlink is given. This will open the Vessel Inspection details screen. Click the \"Back\" button or the \"Vessel Inspection\" given on the breadcrumbs which leads to the search and list page. Changing the Status of Vessel Inspection Hover over the required Finding. The 3 Dot icon appears to reveal the Applicable Status and Delete options. Click the 3 Dot Icon and select the \"Applicable Status\" option. Note - The status will be shown from the workflow based on the requirement and its privilege. Change the required status. This will show the confirmation message for each status change. Deleting the Vessel Inspection Follow the steps below to delete the required Vessel Inspection: Hover over the required vessel inspection. The 3dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon. The menu with two options - Edit and Delete will be displayed. Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
        "children": [
          {
            "title": "Details ",
            "id": 173,
            "content": "Viewing the Detail of Each Vessel Follow the steps below to view the required Vessel Inspection details: Click on the required Start Date where the hyperlink is given. This will open the Vessel Inspection details screen. Click the \"Back\" button or the \"Vessel Inspection\" given on the breadcrumbs which leads to the search and list page. Modifying the Detail of Each Vessel Inspection Follow the steps below to modify the required Vessel Inspection details: Click on the required Start Date where the hyperlink is given. This will open the Vessel Inspection details screen. Click the \" Edit\" button. Change the required details. Click the \"Update\" button. ",
            "children": []
          },
          {
            "title": "Findings",
            "id": 174,
            "content": "This page shows us the details like the list of finding in that particular vessel in a tabular form with column like Finding Type, Serial Number, Target Date, Created by and Status. You can access the Findings page from here : Explorer Menu > Technical > Vessel Inspection > View details > Findings. Under this page we can add new finding, change the status of each finding, can access the details page and delete a finding. The following information is mandatory for adding a new Finding: Finding Type Target Date Finding Details Lack of Familiarity / Training needed. Observation Category Adding the Finding Follow the steps given below to add a new Finding: Click on the \"+ New\" button. This will open up the Add Finding details screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Accessing the Detail of Each Vessel Finding Follow the steps below to view the required finding details: Click on the required Finding Type where the hyperlink is given. This will open the findings details screen. Click the \"Arrow\" button to view the back page or the \"Vessel Inspection\" given on the breadcrumbs which leads to the search and list page. Changing the Status of Each Finding Follow the steps below to change the status of Finding: Hover over the required Finding. The 3 Dot icon appears to reveal the Applicable Status and Delete options. Click the 3 Dot Icon and select the \"Applicable Status\" option. Note - The status will be shown from the workflow based on the requirement and its privilege. Change the required status. This will show the confirmation message for each status change. Deleting the Finding Follow the steps below to delete the required Finding: Hover over the required Finding. The 3 Dot icon appears to reveal the Applicable Current Status and Delete options. Click the 3 Dot Icon. The menu with two options - Edit and Delete will be displayed. Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
            "children": [
              {
                "title": "Findings Details",
                "id": 177,
                "content": "Viewing the Finding Details This page displays the information entered in each field when a new finding is created. Follow the steps below to view the Finding Details: Click on the required finding where the hyperlink is given. This will open up the detailed view page with multiple tabs like Details, Documents, RCA, and Audit Log. Modifying the Finding Details Follow the steps below to modify the Finding Details: Click the \" Edit\" button. Change the required details. Click the \"Update\" button. ",
                "children": []
              },
              {
                "title": "Finding Documents",
                "id": 185,
                "content": "Documents This page provides details of the attached documents required for a vessel inspection finding details where we can upload, edit, view and delete. Adding a New Document Follow the steps below to add a new Document: Click on the \"Upload\" button. This will open up the Add Documents screen. Add the required number of files. Click the \" Save\" button. Modifying the Document Follow the steps below to modify the Document: Hover the required document. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Edit\" option. This will open the Edit Documents screen where the attachments can be added or removed. Change the required details. Click the \"Update\" button. Viewing the Document Follow the steps below to view the Document: Click on the required document where the hyperlink is given for which you want to view the details. This will open the view documents page in read-only mode. Click the \"Close\" button to exit. Remember - You can save or print the required document from here. Deleting the Document Follow the steps below to delete the Document: Hover over the required document. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
                "children": []
              },
              {
                "title": "RCA - Root Cause Analysis",
                "id": 186,
                "content": "This page displays root cause analysis in a card view, allowing you to add, edit, and delete entries. You can also access the Details and Documents tabs, where each document can be added, viewed, edited, or deleted. You can access the RCA page from here : Explorer Menu > Technical > Vessel Inspections > View details > Findings details > RCA To Add a new RCA, the following information is required: Immediate Cause Root Cause Corrective Action Preventive Action Assigned Person Target Date Closeout Date Closeout Comments Adding the RCA Follow the steps below to add a new RCA: Click on the \"+ New\" button. This will open up the Add Root Cause screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the RCA Follow the steps below to modify the RCA: Hover over the required RCA. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \"Edit\" option. This will open up the Edit Root Cause screen. Change the required details. Click the \"Update\" button. Deleting the RCA Follow the steps below to delete the RCA. Hover over the required RCA. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Viewing the RCA Details Follow the steps below to view the RCA details: Select the required Root Cause and expand it. The details tab is opened in default in view mode. Documents This page provides details of the attached documents required for RCA where we can upload, edit, view and delete. Adding a New Document Follow the steps below to add a new Document: Click on the \"Upload\" button. This will open up the Add Documents screen. Enter the necessary details and upload the required number of files. Click the \" Save\" button. Modifying the Document Follow the steps below to modify the Document: Hover the required document. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Edit\" option. This will open the Edit Documents screen where the information can be edited and attachments can be added or removed. Change the required details. Click the \"Update\" button. Viewing the Document Follow the steps below to view the Document: Click on the required document where the hyperlink is given for which you want to view the details. This will open the view documents page in read-only mode. Click the \"Close\" button to exit. Remember - You can save or print the required document from here. Deleting the Document Follow the steps below to delete the Document: Hover the required document. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
                "children": []
              },
              {
                "title": "Finding Audit Log",
                "id": 187,
                "content": "This page shows the audit log of the Vessel Inspection with their user details, log details and description. Note: Certain common functions, such as pagination and download are available exclusively within table data. You can navigate through: Technical > Vessel Inspection > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the log details: Click on the required Date where the hyperlink is given. This will open up the Vessel Inspection details screen. Navigate to the Audit Log tab. Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. Click the \"Close\" button to exit. ",
                "children": []
              }
            ]
          },
          {
            "title": "Documents",
            "id": 175,
            "content": "This page provides details of the attached documents required for a vessel inspection where we can upload, edit, view and delete. Adding a New Document Follow the steps below to add a new Document: Click on the \"Upload\" button. This will open up the Add Documents screen. Add the required number of files. Click the \" Save\" button. Modifying the Document Follow the steps below to modify the Document: Hover over the required document. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Edit\" option. This will open the Edit Documents screen where the attachments can be added or removed. Change the required details. Click the \"Update\" button. Viewing the Document Follow the steps below to view the Document: Click on the required document where the hyperlink is given for which you want to view the details. This will open the view documents page in read-only mode. Click the \"Close\" button to exit. Remember - You can save or print the required document from here. Deleting the Document Follow the steps below to delete the Document: Hover over the required document. The 3 Dot icon appears to reveal the Edit and Delete options. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. ",
            "children": []
          },
          {
            "title": "Vessel Inspection Audit Log",
            "id": 176,
            "content": "This page shows the audit log of the Vessel Inspection with their user details, log details and description. Note: Certain common functions, such as pagination and download are available exclusively within table data. You can navigate through: Technical > Vessel Inspection > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the log details: Click on the required Date where the hyperlink is given. This will open up the Vessel Inspection details screen. Navigate to the Audit Log tab. Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. Click the \"Close\" button to exit. ",
            "children": []
          }
        ]
      },
      {
        "title": "MSQA Inspections",
        "id": 181,
        "content": "A Marine Safety Quality Assurance also known as MSQA ,  is a form that provides key information about a ship before an inspection or charter. It includes details like the vessel’s type, owner, certificates, crew, and inspection history. This helps charterers and inspectors decide if the ship meets safety and operational standards. You can access the MSQA Inspection page from here : Explorer Menu > Technical > MSQA Inspection Finding a Particular MSQA Inspection Follow the steps below to search the required MSQA Inspection details: Select the required Vessels, Types, Classes, Groups or Inspection Type or Start Date or End Date or Status or Inspection Type or Company in the search field. Click the \"Search\" button. The system will display the list of the required MSQA Inspections. This page displays MSQA inspection details in a table format, including columns such as Vessel Name, Inspection Type, Start Date, End Date, Company, Findings, SOC, NOC, Overdue, Created by and Status. This page allows you to add, edit, delete, view details and update the applicable status for a specific MSQA Inspection. The following information is required for adding a new MSQA Inspection: Vessel Name Inspection Type Company Start Date End Date Operation From Port To Port Office Support Inspector Master Chief Engineer Remarks Adding the MSQA Inspection Follow the steps given below to add a new MSQA Inspection: Click on the \"+ New\" button. This will open up the Add New Inspection Details screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Viewing MSQA Inspection Details Follow the steps below to view the MSQA Inspection details: Click on the Vessel Name where the hyperlink is given for which you want to view the details. This will open the details page. Modifying the MSQA Inspection Details Follow the steps below to modify the details of MSQA Inspection: Click on the Vessel Name where the hyperlink is given for which you want to modify the details. This will open the details page by default. Click the \"Edit\" option. Change the required details. Click the \"Update\" button. Findings Adding the Finding Details Follow the steps below to add a new Finding detail: Click on the \"+ New Finding\" button. This will open up the Add Finding screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Viewing the Finding Details Under Findings, you can click the arrow to expand and view the details of the SOC. . The added Findings will appear in the card view. The total count of added Findings, SOC, and NOC will be displayed next to the heading. Follow the steps below to view the required Finding details: Select the desired Finding and click the corresponding arrow to proceed. A separate section for SOC will be displayed, allowing you to add, edit, delete and change the status. Subject of Concern - SOC The Subject of Concern is also known as SOC. Adding the SOC Details Follow the steps below to add a new SOC detail: Click on the \"+ New SOC\" button. This will open up the Add SOC screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the SOC Follow the steps below to modify the required SOC: Hover over the required SOC. The 3 Dot icon appears to reveal the Applicable Status, Edit and Delete option. Click the 3 Dot Icon . The menu appears with three options - Applicable Status, Edit and Delete will be displayed. Click \"Edit\" option. This will open the Edit SOC screen. Change the required details. Click the \"Update\" button. Changing the SOC Status The status can be configured through workflows based on specific requirements, allowing for a structured and customized approval process. This ensures that status changes align with operational needs and predefined workflow rules. Remember - The applicable status and revert status can be configured as per requirements and managed through the workflow with its privileges. Follow the steps below to change the status of required SOC Status: Hover over the required SOC. The 3 Dot icon appears to reveal the Applicable Status, Edit and Delete option. Click the 3 Dot Icon and select the \"Applicable Status\" option. Note - The status will be shown from the workflow based on the requirement and its privilege. Change the required status. This will show the confirmation message for each status change. Viewing the details of SOC To view SOC details, expand the required SOC. It has two tabs—SOC Details will be opened in default and 'SOC Documents'—to access the added information. The SOC Details page displays the information provided when the SOC was created. The SOC Document tab shows all documents related to the SOC, where you can add, edit, view and delete each document as needed. Follow the steps below to view the SOC details: Expand the arrow shown on the required SOC. This will open the SOC details tab by default. SOC Documents This page provides details of the attached documents required for a particular SOC details where you can upload, edit, view and delete. Adding a New SOC Document Follow the steps below to add a new SOC Document: Click on the \"Upload\" button. This will open up the Add SOC Document screen. Add the Document description with required number of files. Click the \" Save\" button. Modifying the SOC Document Follow the steps below to modify the SOC Document: Hover over the required SOC document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Edit\" option. This will open the Edit SOC Documents screen where the attachments can be added or removed. Change the required details. Click the \"Update\" button. Viewing the SOC Document Follow the steps below to view the SOC Document: Click on the required attached document where the hyperlink is given for which you want to view the details. This will open the view documents page in read-only mode. Click the \"Close\" button to exit. Remember - You can save or print the required document from here. Deleting the SOC Document Follow the steps below to delete the SOC Document: Hover over the required document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Nature of Concern - NOC Viewing the NOC details NOC is created within the SOC and is shown in a separate section alongside the SOC details. You can add, delete and update the status of each NOC entry. Adding the NOC Details Follow the steps below to add a new NOC detail: Click on the \"+ New NOC\" button. This will open up the Add NOC screen. Fill in the required details. Ensure all mandatory fields are completed. Click the \"Save\" button. Modifying the NOC Follow the steps below to modify the required NOC: Click on the hyperlink of the desired NOC entry. The RCA details page is opened by default. Click \"Edit\" option. Change the required details. Click the \"Update\" button. NOC Documents This page provides details of the attached documents required for a particular NOC detail where you can upload, edit, view and delete. Adding a New NOC Document Follow the steps below to add a new NOC Document: Click on the \"Upload\" button. This will open up the Add NOC Document screen. Add the Document description with required number of files. Click the \" Save\" button. Modifying the NOC Document Follow the steps below to modify the NOC Document: Hover over the required NOC document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Edit\" option. This will open the Edit NOC Documents screen where the attachments can be added or removed. Change the required details. Click the \"Update\" button. Viewing the NOC Document Follow the steps below to view the NOC Document: Click on the required attached document where the hyperlink is given for which you want to view the details. This will open the view NOC documents page in read-only mode. Click the \"Close\" button to exit. Remember - You can save or print the required document from here. Deleting the NOC Document Follow the steps below to delete the NOC Document: Hover over the required document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Deleting the NOC Follow the steps below to delete the required NOC: Hover over the required NOC. The 3 Dot icon appears to reveal the Delete option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Deleting the SOC Follow the steps below to delete the required SOC: Hover over the required SOC. The 3 Dot icon appears to reveal the Applicable Status, Edit and Delete option. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Deleting the Finding Details Follow the steps below to delete the required Finding: Hover over the required Finding. The 3 dot icon appears to reveal the Delete options. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Documents This page provides details of the attached documents required for a particular MSQA Inspection details where you can upload, edit, view and delete. Adding a New  Document Follow the steps below to add a new Document: Click on the \"Upload\" button. This will open up the Add Document screen. Add the Document description with required number of files. Click the \" Save\" button. Modifying the Document Follow the steps below to modify the Document: Hover over the required document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Edit\" option. This will open the Edit Documents screen where the attachments can be added or removed. Change the required details. Click the \"Update\" button. Viewing the Document Follow the steps below to view the Document: Click on the required attached document where the hyperlink is given for which you want to view the details. This will open the view documents page in read-only mode. Click the \"Close\" button to exit. Remember - You can save or print the required document from here. Deleting the Document Follow the steps below to delete the Document: Hover over the required document. The 3 Dot icon appears to reveal the Edit and Delete option. Click the 3 Dot Icon . The menu appears with two options - Edit and Delete will be displayed. Click \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Audit Log This page shows the audit log of the MSQA Inspections  with their user details, log details and description. You can navigate through Technical >MSQA Inspections > View Details > Audit Log The transaction records are structured as follows: The most recent transactions from the last 7 days are displayed first, followed by transactions from the past 30 days. Older transactions are categorized separately in the 'Older Transactions' section for easy reference. Viewing the details of Each Audit Log Follow the steps below to view the audit log details: Click on the required particular log. This will open up the View Details screen in read-only mode which shows the log data and log description. . Click the \"Close\" button to exit. Deleting the MSQA Inspection Follow the steps below to delete the MSQA Inspection: Hover over the required Vessel. The 3 dot icon appears to reveal the Applicable Status, Edit and Delete options. Click the 3 Dot Icon and select the \"Delete\" option. This will open up the confirmation pop up screen. Click \"Yes Proceed\" button. Changing the MSQA Inspection Status The status can be configured through workflows based on specific requirements, allowing for a structured and customized approval process. This ensures that status changes align with operational needs and predefined workflow rules. Remember - The applicable status and revert status can be configured as per requirements and managed through the workflow with its privileges. Follow the steps below to change the status of required MSQA Inspection Status. Hover over the required Vessel. The 3 dot icon appears to reveal the Applicable Status, Edit, and Delete options. Click the 3 Dot Icon and select the \"Applicable Status\" option. Note - The status will be shown from the workflow based on the requirement and its privilege. Change the required status. This will show the confirmation message for each status change. Viewing the Status History Follow the steps below to view the required status details: Click on the required MSQA Status where the hyperlink is given. This will open up the Status history details screen. Click the \"Close\" icon to exit. ",
        "children": []
      }
    ]
  }
